
All tests passed successfully for `reference_architectures/foundry_basic` ✅

**Workflow Run:** [17221685694](https://github.com/microsoft/CAIRA/actions/runs/17221685694)

#### 🔢 Terraform Version and Platform: `1.13.0/linux_amd64`

#### 🖌 Terraform Format and Style: `success ✅`

#### ⚙️ Terraform Initialization: `success ✅`

#### 🤖 Terraform Validation: `success ✅`

<details><summary>Show Output</summary>

```text
Success! The configuration is valid.


```

</details>



<details><summary>Show Error</summary>

```text

```

</details>



#### 🩺 Terraform Plan Exit Code: `2`

<details><summary>Show Output</summary>

```text
module.application_insights.data.modtm_module_source.telemetry[0]: Reading...
module.application_insights.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.application_insights.data.azurerm_client_config.telemetry[0]: Reading...
module.application_insights.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02NzRlNzc3MS1iYmNlLTQwMGMtOWM2OS1lMThhMTZlNDNlZDY7b2JqZWN0SWQ9ZDhlNDQyYzUtM2YzNy00MjU5LThlZWItYzQxMzhlZjg1NjM1O3N1YnNjcmlwdGlvbklkPTdhZWMzNjBiLTM1NGUtNGMzYS1iMmU2LWE2NDYyYTc0OTBiZjt0ZW5hbnRJZD0yOTdmMDg1Ny1mZWQ0LTRmNjUtOTAzOS01MWJiMDdlM2ZiMDQ=]
module.ai_foundry.data.azurerm_client_config.current: Reading...
module.ai_foundry.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02NzRlNzc3MS1iYmNlLTQwMGMtOWM2OS1lMThhMTZlNDNlZDY7b2JqZWN0SWQ9ZDhlNDQyYzUtM2YzNy00MjU5LThlZWItYzQxMzhlZjg1NjM1O3N1YnNjcmlwdGlvbklkPTdhZWMzNjBiLTM1NGUtNGMzYS1iMmU2LWE2NDYyYTc0OTBiZjt0ZW5hbnRJZD0yOTdmMDg1Ny1mZWQ0LTRmNjUtOTAzOS01MWJiMDdlM2ZiMDQ=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "swedencentral"
      + name                            = (known after apply)
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = (known after apply)
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.this[0] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = (known after apply)
    }

  # module.ai_foundry.azapi_resource.ai_foundry will be created
  + resource "azapi_resource" "ai_foundry" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + kind       = "AIServices"
          + properties = {
              + allowProjectManagement = true
              + customSubDomainName    = (known after apply)
              + disableLocalAuth       = false
              + networkAcls            = null
              + networkInjections      = null
              + publicNetworkAccess    = "Enabled"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "swedencentral"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.ai_foundry_project will be created
  + resource "azapi_resource" "ai_foundry_project" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + properties = {
              + description = "Default Project description"
              + displayName = "Default Project"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "swedencentral"
      + name                      = "default-project"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
          + "properties.internalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/projects@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.appinsights_connection[0] will be created
  + resource "azapi_resource" "appinsights_connection" {
      + body                      = {
          + name       = (known after apply)
          + properties = {
              + authType      = "ApiKey"
              + category      = "AppInsights"
              + credentials   = {
                  + key = (sensitive value)
                }
              + isSharedToAll = false
              + metadata      = {
                  + ApiType    = "Azure"
                  + ResourceId = (known after apply)
                }
              + target        = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource_action.purge_ai_foundry will be created
  + resource "azapi_resource_action" "purge_ai_foundry" {
      + id               = (known after apply)
      + method           = "DELETE"
      + output           = (known after apply)
      + resource_id      = (known after apply)
      + sensitive_output = (sensitive value)
      + type             = "Microsoft.Resources/resourceGroups/deletedAccounts@2021-04-30"
      + when             = "destroy"
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["gpt-4.1"] will be created
  + resource "azurerm_cognitive_deployment" "model_deployments" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gpt-4.1"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4.1"
          + version = "2025-04-14"
        }

      + sku {
          + capacity = 1
          + name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["o4-mini"] will be created
  + resource "azurerm_cognitive_deployment" "model_deployments" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "o4-mini"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "o4-mini"
          + version = "2025-04-16"
        }

      + sku {
          + capacity = 1
          + name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["text-embedding-3-large"] will be created
  + resource "azurerm_cognitive_deployment" "model_deployments" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "text-embedding-3-large"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "text-embedding-3-large"
          + version = "1"
        }

      + sku {
          + capacity = 1
          + name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.time_sleep.ai_search_connection_destroy_delay will be created
  + resource "time_sleep" "ai_search_connection_destroy_delay" {
      + destroy_duration = "60s"
      + id               = (known after apply)
    }

  # module.ai_foundry.time_sleep.wait_before_purge will be created
  + resource "time_sleep" "wait_before_purge" {
      + destroy_duration = "60s"
      + id               = (known after apply)
    }

  # module.ai_foundry.time_sleep.wait_project_identities will be created
  + resource "time_sleep" "wait_project_identities" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 100
      + daily_data_cap_notifications_disabled = false
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "swedencentral"
      + name                                  = (known after apply)
      + resource_group_name                   = (known after apply)
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.application_insights.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "swedencentral"
          + "module_source"   = "registry.terraform.io/Azure/avm-res-insights-component/azurerm"
          + "module_version"  = "0.2.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "7aec360b-354e-4c3a-b2e6-a6462a7490bf"
          + "tenant_id"       = "297f0857-fed4-4f65-9039-51bb07e3fb04"
        }
    }

  # module.application_insights.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.naming.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.naming.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ai_foundry_id                            = (known after apply)
  + ai_foundry_model_deployments_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + ai_foundry_name                          = (known after apply)
  + ai_foundry_project_id                    = (known after apply)
  + ai_foundry_project_identity_principal_id = (known after apply)
  + ai_foundry_project_name                  = "default-project"
  + application_insights_id                  = (known after apply)
  + log_analytics_workspace_id               = (known after apply)
  + resource_group_id                        = (known after apply)
  + resource_group_name                      = (known after apply)

```

</details>



<details><summary>Show Error</summary>

```text

```

</details>



#### 📖 Terraform Plan: `success ✅`

<details><summary>Show Output</summary>

```text

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.this will be created
+   resource "azurerm_log_analytics_workspace" "this" {
+       allow_resource_only_permissions = true
+       daily_quota_gb                  = -1
+       id                              = (known after apply)
+       internet_ingestion_enabled      = true
+       internet_query_enabled          = true
+       local_authentication_disabled   = (known after apply)
+       local_authentication_enabled    = (known after apply)
+       location                        = "swedencentral"
+       name                            = (known after apply)
+       primary_shared_key              = (sensitive value)
+       resource_group_name             = (known after apply)
+       retention_in_days               = 30
+       secondary_shared_key            = (sensitive value)
+       sku                             = "PerGB2018"
+       workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.this[0] will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "swedencentral"
+       name     = (known after apply)
    }

  # module.ai_foundry.azapi_resource.ai_foundry will be created
+   resource "azapi_resource" "ai_foundry" {
+       body                      = {
+           identity   = {
+               type = "SystemAssigned"
            }
+           kind       = "AIServices"
+           properties = {
+               allowProjectManagement = true
+               customSubDomainName    = (known after apply)
+               disableLocalAuth       = false
+               networkAcls            = null
+               networkInjections      = null
+               publicNetworkAccess    = "Enabled"
            }
+           sku        = {
+               name = "S0"
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       location                  = "swedencentral"
+       name                      = (known after apply)
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       tags                      = (known after apply)
+       type                      = "Microsoft.CognitiveServices/accounts@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.ai_foundry_project will be created
+   resource "azapi_resource" "ai_foundry_project" {
+       body                      = {
+           identity   = {
+               type = "SystemAssigned"
            }
+           properties = {
+               description = "Default Project description"
+               displayName = "Default Project"
            }
+           sku        = {
+               name = "S0"
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       location                  = "swedencentral"
+       name                      = "default-project"
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       response_export_values    = [
+           "identity.principalId",
+           "properties.internalId",
        ]
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       type                      = "Microsoft.CognitiveServices/accounts/projects@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.appinsights_connection[0] will be created
+   resource "azapi_resource" "appinsights_connection" {
+       body                      = {
+           name       = (known after apply)
+           properties = {
+               authType      = "ApiKey"
+               category      = "AppInsights"
+               credentials   = {
+                   key = (sensitive value)
                }
+               isSharedToAll = false
+               metadata      = {
+                   ApiType    = "Azure"
+                   ResourceId = (known after apply)
                }
+               target        = (known after apply)
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       location                  = (known after apply)
+       name                      = (known after apply)
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       tags                      = (known after apply)
+       type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource_action.purge_ai_foundry will be created
+   resource "azapi_resource_action" "purge_ai_foundry" {
+       id               = (known after apply)
+       method           = "DELETE"
+       output           = (known after apply)
+       resource_id      = (known after apply)
+       sensitive_output = (sensitive value)
+       type             = "Microsoft.Resources/resourceGroups/deletedAccounts@2021-04-30"
+       when             = "destroy"
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["gpt-4.1"] will be created
+   resource "azurerm_cognitive_deployment" "model_deployments" {
+       cognitive_account_id   = (known after apply)
+       id                     = (known after apply)
+       name                   = "gpt-4.1"
+       version_upgrade_option = "OnceNewDefaultVersionAvailable"

+       model {
+           format  = "OpenAI"
+           name    = "gpt-4.1"
+           version = "2025-04-14"
        }

+       sku {
+           capacity = 1
+           name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["o4-mini"] will be created
+   resource "azurerm_cognitive_deployment" "model_deployments" {
+       cognitive_account_id   = (known after apply)
+       id                     = (known after apply)
+       name                   = "o4-mini"
+       version_upgrade_option = "OnceNewDefaultVersionAvailable"

+       model {
+           format  = "OpenAI"
+           name    = "o4-mini"
+           version = "2025-04-16"
        }

+       sku {
+           capacity = 1
+           name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["text-embedding-3-large"] will be created
+   resource "azurerm_cognitive_deployment" "model_deployments" {
+       cognitive_account_id   = (known after apply)
+       id                     = (known after apply)
+       name                   = "text-embedding-3-large"
+       version_upgrade_option = "OnceNewDefaultVersionAvailable"

+       model {
+           format  = "OpenAI"
+           name    = "text-embedding-3-large"
+           version = "1"
        }

+       sku {
+           capacity = 1
+           name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.time_sleep.ai_search_connection_destroy_delay will be created
+   resource "time_sleep" "ai_search_connection_destroy_delay" {
+       destroy_duration = "60s"
+       id               = (known after apply)
    }

  # module.ai_foundry.time_sleep.wait_before_purge will be created
+   resource "time_sleep" "wait_before_purge" {
+       destroy_duration = "60s"
+       id               = (known after apply)
    }

  # module.ai_foundry.time_sleep.wait_project_identities will be created
+   resource "time_sleep" "wait_project_identities" {
+       create_duration = "10s"
+       id              = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                                = (known after apply)
+       application_type                      = "other"
+       connection_string                     = (sensitive value)
+       daily_data_cap_in_gb                  = 100
+       daily_data_cap_notifications_disabled = false
+       disable_ip_masking                    = false
+       force_customer_storage_for_profiler   = false
+       id                                    = (known after apply)
+       instrumentation_key                   = (sensitive value)
+       internet_ingestion_enabled            = true
+       internet_query_enabled                = true
+       local_authentication_disabled         = false
+       location                              = "swedencentral"
+       name                                  = (known after apply)
+       resource_group_name                   = (known after apply)
+       retention_in_days                     = 90
+       sampling_percentage                   = 100
+       workspace_id                          = (known after apply)
    }

  # module.application_insights.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "swedencentral"
+           "module_source"   = "registry.terraform.io/Azure/avm-res-insights-component/azurerm"
+           "module_version"  = "0.2.0"
+           "random_id"       = (known after apply)
+           "subscription_id" = "7aec360b-354e-4c3a-b2e6-a6462a7490bf"
+           "tenant_id"       = "297f0857-fed4-4f65-9039-51bb07e3fb04"
        }
    }

  # module.application_insights.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   ai_foundry_id                            = (known after apply)
+   ai_foundry_model_deployments_ids         = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   ai_foundry_name                          = (known after apply)
+   ai_foundry_project_id                    = (known after apply)
+   ai_foundry_project_identity_principal_id = (known after apply)
+   ai_foundry_project_name                  = "default-project"
+   application_insights_id                  = (known after apply)
+   log_analytics_workspace_id               = (known after apply)
+   resource_group_id                        = (known after apply)
+   resource_group_name                      = (known after apply)

```

</details>





*Pusher: @timfpark, Action: `pull_request`, Working Directory: `reference_architectures/foundry_basic`, Workflow: `Terraform Test`*
